import pandas as pd

category_keywords = {
    "війна": [
        "зсу", "війна", "армія", "обстріл", "окупант", "поранення", "дрон", "вторгнення",
        "фронт", "мобілізація", "артилерія", "ракета", "оборонці", "пво", "прильот", "контрнаступ",
        "бойові", "міна", "позиції", "вибух"
    ],
    "політика": [
        "вибори", "президент", "закон", "рада", "депутат", "політик", "уряд",
        "кабмін", "реформи", "міністр", "парламент", "голосування", "санкції", "опозиція"
    ],
    "освіта": [
        "школа", "університет", "зно", "екзамен", "навчання", "студент",
        "олімпіада", "вступ", "викладач", "семестр", "освітній", "диплом", "грант", "рейтинг"
    ],
    "економіка": [
        "гривня", "долар", "ціна", "економіка", "банк", "інфляція", "курс",
        "податки", "бюджет", "імпорт", "експорт", "зарплата", "енергоносії", "фінанси", "інвестиції"
    ],
    "погода": [
        "градус", "погода", "дощ", "температура", "гроза", "мороз", "вітер",
        "спека", "сніг", "буря", "хуртовина", "сонце", "опади", "прогноз", "заморозки"
    ],
    "культура": [
        "євробачення", "кіно", "музика", "театр", "фестиваль", "культура", "сукня",
        "книга", "література", "художник", "концерт", "прем'єра", "серіал", "виставка", "режисер"
    ],
    "здоров’я": [
        "здоров’я", "лікар", "грип", "епідемія", "вакцина", "лікування",
        "коронавірус", "медик", "клініка", "симптоми", "діагноз", "госпіталь", "психолог", "інфекція"
    ],
    "спорт": [
        "футбол", "матч", "спорт", "олімпіада", "тренер", "перемога", "турнір",
        "збірна", "гравець", "ліга", "чемпіон", "голь", "спортсмен", "рекорд", "медаль"
    ],
    "технології": [
        "технологія", "штучний", "інтелект", "айті", "інновації", "розробка", "гаджет",
        "смартфон", "комп'ютер", "додаток", "цифровий", "інтернет", "нейромережа", "робот", "сервер"
    ],
    "соціум": [
        "пенсія", "населення", "мігранти", "волонтери", "допомога", "соціальний", "біженці",
        "суспільство", "люди", "насильство", "права", "пільги", "діти", "сім’я", "житло"
    ],
    "злочини/нп": [
        "злочин", "вбивство", "крадіжка", "поліція", "суд", "слідство", "пожежа",
        "дтп", "аварія", "напад", "арешт", "затримано", "вибухівка", "катастрофа", "розслідування"
    ]
}


def classify_topic(text):
    words = text.lower().split('_')
    scores = {cat: 0 for cat in category_keywords}

    for word in words:
        for category, kw_list in category_keywords.items():
            if word in kw_list:
                scores[category] += 1

    best_category = max(scores, key=scores.get)
    return best_category if scores[best_category] > 0 else "інше"


def classify_dataframe_topics(df, column="Theme"):
    if isinstance(df, pd.DataFrame):
        df = df.copy()  
    else:
        raise ValueError(f"Очікується DataFrame, але отримали {type(df)}")
    
    df["Category"] = df[column].apply(classify_topic)
    return df
